# -*- encoding: utf-8 -*-
# @Time    : 2018-04-16 23:57
# @Author  : mike.liu
# @File    : 购物车.py
#
# 数据结构：
# goods = [
# {"name": "电脑", "price": 1999},
# {"name": "鼠标", "price": 10},
# {"name": "游艇", "price": 20},
# {"name": "美女", "price": 998},
# ......
# ]
#
# 功能要求：
# 基础要求：
#
# 1、启动程序后，输入用户名密码后，让用户输入工资，然后打印商品列表
#
# 2、允许用户根据商品编号购买商品
#
# 3、用户选择商品后，检测余额是否够，够就直接扣款，不够就提醒
#
# 4、可随时退出，退出时，打印已购买商品和余额
#
# 5、在用户使用过程中， 关键输出，如余额，商品已加入购物车等消息，需高亮显示
#
#
# 扩展需求：
#
# 1、用户下一次登录后，输入用户名密码，直接回到上次的状态，即上次消费的余额什么的还是那些，再次登录可继续购买
#
# 2、允许查询之前的消费记录

goods = [
    {"name": "电脑", "price": 1999},
    {"name": "鼠标", "price": 10},
    {"name": "游艇", "price": 20},
    {"name": "美女", "price": 998},
    {"name": "飞机", "price": 9999}
]

username = input("请输入你的用户名:")
password = input("请输入你的密码:")

pay = input("请输入你的工资:")
print("--------商品列表如下:-------")
for i in goods:

    print(i)

