# -*- encoding: utf-8 -*-
# @Time    : 18-6-22 上午10:40
# @Author  : mike.liu
# @File    : 练习题.py

# 练习题
# 什么是C/S架构？

#
# 互联网协议是什么？分别介绍五层协议中每一层的功能？
#
# 基于tcp协议通信，为何建立链接需要三次握手，而断开链接却需要四次挥手
#
# 为何基于tcp协议的通信比基于udp协议的通信更可靠？
#
# ‍流式协议指的是什么协议，数据报协议指的是什么协议？
#
# 什么是socket？简述基于tcp协议的套接字通信流程
#
# 什么是粘包？ socket 中造成粘包的原因是什么？ 哪些情况会发生粘包现象？
#
# 基于socket开发一个聊天程序，实现两端互相发送和接收消息
#
# 基于tcp socket，开发简单的远程命令执行程序，允许用户执行命令，并返回结果
#
# 基于tcp协议编写简单FTP程序，实现上传、下载文件功能，并解决粘包问题
#
# 基于udp协议编写程序，实现功能
#
# 执行指定的命令，让客户端可以查看服务端的时间
#
# 执行指定的命令，让客户端可以与服务的的时间同步

